//行业
var industryJson = {
	"pageTotal" : 53,
	"industryList" : [ {
		"name" : "互联网/IT/通信",
		"code" : "H0001",
		"children" : [ {
			"name" : "互联网/电子商务/软件",
			"code" : "H00010001"
		}, {
			"name" : "测试/运维",
			"code" : "H00010002"
		}, {
			"name" : "运营/产品/设计",
			"code" : "H00010003"
		}, {
			"name" : "项目管理",
			"code" : "H00010004"
		}, {
			"name" : "通信(设备/运营/增值)",
			"code" : "H00010005"
		}, {
			"name" : "计算机硬件/网络设备",
			"code" : "H00010006"
		} ]
	}, {
		"name" : "交通/贸易/物流",
		"code" : "H0002",
		"children" : [ {
			"name" : "交通/物流/运输",
			"code" : "H00020001"
		}, {
			"name" : "贸易/进出口",
			"code" : "H00020002"
		}, {
			"name" : "航空/航天",
			"code" : "H00020003"
		} ]
	}, {
		"name" : "制药/医疗",
		"code" : "H0003",
		"children" : [ {
			"name" : "制药/生物工程",
			"code" : "H00030001"
		}, {
			"name" : "医疗/保健/美容/卫生服务",
			"code" : "H00030002"
		}, {
			"name" : "医疗设备/器械",
			"code" : "H00030003"
		} ]
	}, {
		"name" : "广告/传媒/教育/文化",
		"code" : "H0004",
		"children" : [ {
			"name" : "广告/公关/市场推广/会展",
			"code" : "H00040001"
		}, {
			"name" : "影视/媒体/艺术/文化/出版",
			"code" : "H00040002"
		}, {
			"name" : "教育/培训/学术/科研/院校",
			"code" : "H00040003"
		} ]
	}, {
		"name" : "房地产/建筑/物业",
		"code" : "H0005",
		"children" : [ {
			"name" : "房地产开发/建筑/建材/工程",
			"code" : "H00050001"
		}, {
			"name" : "规划/设计/装潢",
			"code" : "H00050002"
		}, {
			"name" : "房地产服务（物业管理/地产经纪）",
			"code" : "H00050003"
		} ]
	}, {
		"name" : "政府/农林牧渔",
		"code" : "H0006",
		"children" : [ {
			"name" : "政府/公共事业/非营利机构",
			"code" : "H00060001"
		}, {
			"name" : "农/林/牧/渔",
			"code" : "H00060002"
		} ]
	}, {
		"name" : "服务/中介",
		"code" : "H0007",
		"children" : [ {
			"name" : "咨询/翻译",
			"code" : "H00070001"
		}, {
			"name" : "中介服务",
			"code" : "H00070002"
		}, {
			"name" : "旅游/酒店/餐饮服务/生活服务",
			"code" : "H00070005"
		} ]
	}, {
		"name" : "汽车/机械/制造",
		"code" : "H0008",
		"children" : [ {
			"name" : "汽车服务",
			"code" : "H00080002"
		}, {
			"name" : "印刷/包装/造纸",
			"code" : "H00080003"
		}, {
			"name" : "电子/仪器/仪表/半导体/电器",
			"code" : "H00080005"
		}, {
			"name" : "生产管理",
			"code" : "H00080006"
		}, {
			"name" : "质量管理",
			"code" : "H00080007"
		}, {
			"name" : "维修",
			"code" : "H00080008"
		}, {
			"name" : "设计/研发",
			"code" : "H00080009"
		}, {
			"name" : "制造",
			"code" : "H00080010"
		} ]
	}, {
		"name" : "消费品",
		"code" : "H0009",
		"children" : [ {
			"name" : "食品/饮料/烟酒/日化",
			"code" : "H00090001"
		}, {
			"name" : "百货/批发/零售",
			"code" : "H00090002"
		}, {
			"name" : "服装服饰/纺织/皮革",
			"code" : "H00090003"
		} ]
	}, {
		"name" : "能源/化工/环保",
		"code" : "H0011",
		"children" : [ {
			"name" : "能源（电力/水利）",
			"code" : "H00110001"
		}, {
			"name" : "石油/石化/化工",
			"code" : "H00110002"
		}, {
			"name" : "采掘/冶炼/矿产",
			"code" : "H00110003"
		}, {
			"name" : "环保",
			"code" : "H00110004"
		} ]
	}, {
		"name" : "金融",
		"code" : "H0012",
		"children" : [ {
			"name" : "银行",
			"code" : "H00120001"
		}, {
			"name" : "保险",
			"code" : "H00120002"
		}, {
			"name" : "基金/证券/期货/投资",
			"code" : "H00120003"
		}, {
			"name" : "信托/担保/拍卖/典当",
			"code" : "H00120005"
		} ]
	} ]
}

// 薪资要求
var salaryJson = [ {
	code : '',
	name : '不限'
}, {
	code : '53960000',
	name : '5万以下'
}, {
	code : '22530000',
	name : '5-8万'
}, {
	code : '22520000',
	name : '8-12万'
}, {
	code : '53970000',
	name : '12-15万'
}, {
	code : '12021000',
	name : '15-20万'
}, {
	code : '12022000',
	name : '20-25万'
}, {
	code : '53950000',
	name : '25-30万'
}, {
	code : '12023000',
	name : '30-40万'
}, {
	code : '12025000',
	name : '40-50万'
}, {
	code : '12026000',
	name : '50-100万'
}, {
	code : '12027000',
	name : '100万以上'
} ];

// 学历
var diplomaJson = [ {
	code : '',
	name : '不限'
},{
	code : '12019000',
	name : '高中及以下'
}, {
	code : '12086000',
	name : '大专'
}, {
	code : '12087000',
	name : '本科'
}, {
	code : '12088000',
	name : '硕士'
}, {
	code : '12089000',
	name : '博士'
}, {
	code : '15393000',
	name : 'MBA'
}, {
	code : '15394000',
	name : 'EMBA'
} ];

var workYearJson = [{
	code : '',
	name : '不限'
}, {
	code : '12050000',
	name : '应届生'
}, {
	code : '12051000',
	name : '1年'
}, {
	code : '12052000',
	name : '1-3年'
}, {
	code : '12053000',
	name : '3-5年'
}, {
	code : '12054000',
	name : '5-10年'
}, {
	code : '21770000',
	name : '10年以上'
} ];

var sexJson = [ {
	name : '不限',
	code : ''
}, {
	name : '男',
	code : '男'
}, {
	name : '女',
	code : '女'
} ];


var scaleJson = [ {
	name : '1-20人',
	code : '12111000'
}, {
	name : '21-50人',
	code : '12112000'
}, {
	name : '51-100人',
	code : '12113000'
}, {
	name : '101-500人',
	code : '12114000'
} , {
	name : '500人以上',
	code : '12115000'
}  ];


var natureJson = [ {
	name : '外资（欧美）',
	code : '22184000'
}, {
	name : '外资（非欧美）',
	code : '22185000'
}, {
	name : '合资',
	code : '22186000'
}, {
	name : '国企',
	code : '22187000'
} , {
	name : '民营公司',
	code : '22188000'
} , {
	name : '国内上市公司',
	code : '22189000'
}, {
	name : '事业单位',
	code : '22190000'
}, {
	name : '非盈利机构',
	code : '22191000'
}, {
	name : '股份有限公司',
	code : '54080000'
}, {
	name : '其他性质',
	code : '22192000'
}];


