/*
 * 
 * 	锂电产品分类json数据
 *  list 全部分类
 *  list1 一级分类
 *  list2 二级分类
 *  list3 三级分类
 * 
 */

/*
 * 全部分类
 */
var list = [ {
	"kind" : "1",
	"name" : "基础材料",
	"pId" : "0",
	"id" : "100000"
}, {
	"kind" : "2",
	"name" : "钴原矿",
	"pId" : "100000",
	"id" : "100100"
}, {
	"kind" : "3",
	"name" : "钴原矿",
	"pId" : "100100",
	"id" : "100101"
}, {
	"kind" : "2",
	"name" : "钴精矿",
	"pId" : "100000",
	"id" : "100200"
}, {
	"kind" : "3",
	"name" : "钴精矿",
	"pId" : "100200",
	"id" : "100201"
}, {
	"kind" : "2",
	"name" : "锂原矿",
	"pId" : "100000",
	"id" : "100300"
}, {
	"kind" : "3",
	"name" : "锂原矿",
	"pId" : "100300",
	"id" : "100301"
}, {
	"kind" : "2",
	"name" : "锂精矿",
	"pId" : "100000",
	"id" : "100400"
}, {
	"kind" : "3",
	"name" : "锂精矿",
	"pId" : "100400",
	"id" : "100401"
}, {
	"kind" : "2",
	"name" : "卤水锂",
	"pId" : "100000",
	"id" : "100500"
}, {
	"kind" : "3",
	"name" : "卤水锂",
	"pId" : "100500",
	"id" : "100501"
}, {
	"kind" : "1",
	"name" : "正极材料",
	"pId" : "0",
	"id" : "110000"
}, {
	"kind" : "2",
	"name" : "钴酸锂正极材料",
	"pId" : "110000",
	"id" : "110100"
}, {
	"kind" : "3",
	"name" : "钴酸锂正极材料",
	"pId" : "110100",
	"id" : "110101"
}, {
	"kind" : "2",
	"name" : "三元正极材料",
	"pId" : "110000",
	"id" : "110200"
}, {
	"kind" : "3",
	"name" : "三元正极材料",
	"pId" : "110200",
	"id" : "110201"
}, {
	"kind" : "2",
	"name" : "锰酸锂正极材料",
	"pId" : "110000",
	"id" : "110300"
}, {
	"kind" : "3",
	"name" : "锰酸锂正极材料",
	"pId" : "110300",
	"id" : "110301"
}, {
	"kind" : "2",
	"name" : "磷酸铁锂正极材料",
	"pId" : "110000",
	"id" : "110400"
}, {
	"kind" : "3",
	"name" : "磷酸铁锂正极材料",
	"pId" : "110400",
	"id" : "110401"
}, {
	"kind" : "1",
	"name" : "负极材料",
	"pId" : "0",
	"id" : "120000"
}, {
	"kind" : "2",
	"name" : "天然石墨类负极材料",
	"pId" : "120000",
	"id" : "120100"
}, {
	"kind" : "3",
	"name" : "天然石墨类负极材料",
	"pId" : "120100",
	"id" : "120101"
}, {
	"kind" : "2",
	"name" : "人造石墨类负极材料",
	"pId" : "120000",
	"id" : "120200"
}, {
	"kind" : "3",
	"name" : "人造石墨类负极材料",
	"pId" : "120200",
	"id" : "120201"
}, {
	"kind" : "2",
	"name" : "中间相碳微球负极材料",
	"pId" : "120000",
	"id" : "120300"
}, {
	"kind" : "3",
	"name" : "中间相碳微球负极材料",
	"pId" : "120300",
	"id" : "120301"
}, {
	"kind" : "2",
	"name" : "预焙阳极",
	"pId" : "120000",
	"id" : "120400"
}, {
	"kind" : "3",
	"name" : "预焙阳极",
	"pId" : "120400",
	"id" : "120401"
}, {
	"kind" : "2",
	"name" : "等静压石墨",
	"pId" : "120000",
	"id" : "120500"
}, {
	"kind" : "3",
	"name" : "等静压石墨",
	"pId" : "120500",
	"id" : "120501"
}, {
	"kind" : "2",
	"name" : "石墨块",
	"pId" : "120000",
	"id" : "120600"
}, {
	"kind" : "3",
	"name" : "石墨块",
	"pId" : "120600",
	"id" : "120601"
}, {
	"kind" : "2",
	"name" : "炭电极",
	"pId" : "120000",
	"id" : "120700"
}, {
	"kind" : "3",
	"name" : "炭电极",
	"pId" : "120700",
	"id" : "120701"
}, {
	"kind" : "2",
	"name" : "天然石墨",
	"pId" : "120000",
	"id" : "120800"
}, {
	"kind" : "3",
	"name" : "天然石墨",
	"pId" : "120800",
	"id" : "120801"
}, {
	"kind" : "2",
	"name" : "石油焦",
	"pId" : "120000",
	"id" : "120900"
}, {
	"kind" : "3",
	"name" : "石油焦",
	"pId" : "120900",
	"id" : "120901"
}, {
	"kind" : "2",
	"name" : "煤沥青",
	"pId" : "120000",
	"id" : "121000"
}, {
	"kind" : "3",
	"name" : "煤沥青",
	"pId" : "121000",
	"id" : "121001"
}, {
	"kind" : "2",
	"name" : "活性炭",
	"pId" : "120000",
	"id" : "121100"
}, {
	"kind" : "3",
	"name" : "活性炭",
	"pId" : "121100",
	"id" : "121101"
}, {
	"kind" : "2",
	"name" : "无烟煤",
	"pId" : "120000",
	"id" : "121200"
}, {
	"kind" : "3",
	"name" : "无烟煤",
	"pId" : "121200",
	"id" : "121201"
}, {
	"kind" : "2",
	"name" : "阴极炭块",
	"pId" : "120000",
	"id" : "121300"
}, {
	"kind" : "3",
	"name" : "阴极炭块",
	"pId" : "121300",
	"id" : "121301"
}, {
	"kind" : "2",
	"name" : "石墨电极",
	"pId" : "120000",
	"id" : "121400"
}, {
	"kind" : "3",
	"name" : "石墨电极",
	"pId" : "121400",
	"id" : "121401"
}, {
	"kind" : "2",
	"name" : "增碳剂",
	"pId" : "120000",
	"id" : "121500"
}, {
	"kind" : "3",
	"name" : "增碳剂",
	"pId" : "121500",
	"id" : "121501"
}, {
	"kind" : "2",
	"name" : "针状焦",
	"pId" : "120000",
	"id" : "121600"
}, {
	"kind" : "3",
	"name" : "针状焦",
	"pId" : "121600",
	"id" : "121601"
}, {
	"kind" : "1",
	"name" : "锂化合物",
	"pId" : "0",
	"id" : "130000"
}, {
	"kind" : "2",
	"name" : "碳酸锂",
	"pId" : "130000",
	"id" : "130100"
}, {
	"kind" : "3",
	"name" : "电池级碳酸锂（Li2CO3:99.5%）",
	"pId" : "130100",
	"id" : "130101"
}, {
	"kind" : "3",
	"name" : "工业级碳酸锂（Li2CO3:99%）",
	"pId" : "130100",
	"id" : "130102"
}, {
	"kind" : "2",
	"name" : "氢氧化锂",
	"pId" : "130000",
	"id" : "130200"
}, {
	"kind" : "3",
	"name" : "单水氢氧化锂（LiOH :≥56.5%;Na:≤0.002% ）",
	"pId" : "130200",
	"id" : "130201"
}, {
	"kind" : "3",
	"name" : "单水氢氧化锂（LiOH :≥96%;Na:≤0.003%  ）",
	"pId" : "130200",
	"id" : "130202"
}, {
	"kind" : "3",
	"name" : "电池级氢氧化锂（LiOH:99% ）",
	"pId" : "130200",
	"id" : "130203"
}, {
	"kind" : "2",
	"name" : "氯化锂",
	"pId" : "130000",
	"id" : "130300"
}, {
	"kind" : "3",
	"name" : "氯化锂",
	"pId" : "130300",
	"id" : "130301"
}, {
	"kind" : "2",
	"name" : "锰酸锂",
	"pId" : "130000",
	"id" : "130400"
}, {
	"kind" : "3",
	"name" : "锰酸锂",
	"pId" : "130400",
	"id" : "130401"
}, {
	"kind" : "2",
	"name" : "钴酸锂",
	"pId" : "130000",
	"id" : "130500"
}, {
	"kind" : "3",
	"name" : "钴酸锂",
	"pId" : "130500",
	"id" : "130501"
}, {
	"kind" : "2",
	"name" : "磷酸铁锂",
	"pId" : "130000",
	"id" : "130600"
}, {
	"kind" : "3",
	"name" : "磷酸铁锂",
	"pId" : "130600",
	"id" : "130601"
}, {
	"kind" : "2",
	"name" : "镍钴锰酸锂",
	"pId" : "130000",
	"id" : "130700"
}, {
	"kind" : "3",
	"name" : "镍钴锰酸锂",
	"pId" : "130700",
	"id" : "130701"
}, {
	"kind" : "2",
	"name" : "氧化锂",
	"pId" : "130000",
	"id" : "130800"
}, {
	"kind" : "3",
	"name" : "氧化锂",
	"pId" : "130800",
	"id" : "130801"
}, {
	"kind" : "2",
	"name" : "锂镍钴锰氧化物",
	"pId" : "130000",
	"id" : "130900"
}, {
	"kind" : "3",
	"name" : "锂镍钴锰氧化物",
	"pId" : "130900",
	"id" : "130901"
}, {
	"kind" : "1",
	"name" : "前驱体",
	"pId" : "0",
	"id" : "140000"
}, {
	"kind" : "2",
	"name" : "磷酸铁锂前驱体",
	"pId" : "140000",
	"id" : "140100"
}, {
	"kind" : "3",
	"name" : "磷酸铁锂前驱体",
	"pId" : "140100",
	"id" : "140101"
}, {
	"kind" : "2",
	"name" : "三元前驱体",
	"pId" : "140000",
	"id" : "140200"
}, {
	"kind" : "3",
	"name" : "三元前驱体",
	"pId" : "140200",
	"id" : "140201"
}, {
	"kind" : "2",
	"name" : "碳酸锂前驱体",
	"pId" : "140000",
	"id" : "140300"
}, {
	"kind" : "3",
	"name" : "碳酸锂前驱体",
	"pId" : "140300",
	"id" : "140301"
}, {
	"kind" : "2",
	"name" : "钴酸锂前驱体",
	"pId" : "140000",
	"id" : "140400"
}, {
	"kind" : "3",
	"name" : "钴酸锂前驱体",
	"pId" : "140400",
	"id" : "140401"
}, {
	"kind" : "1",
	"name" : "锂电辅料",
	"pId" : "0",
	"id" : "150000"
}, {
	"kind" : "2",
	"name" : "极耳",
	"pId" : "150000",
	"id" : "150100"
}, {
	"kind" : "3",
	"name" : "极耳",
	"pId" : "150100",
	"id" : "150101"
}, {
	"kind" : "2",
	"name" : "铜箔",
	"pId" : "150000",
	"id" : "150200"
}, {
	"kind" : "3",
	"name" : "铜箔",
	"pId" : "150200",
	"id" : "150201"
}, {
	"kind" : "2",
	"name" : "铝箔",
	"pId" : "150000",
	"id" : "150300"
}, {
	"kind" : "3",
	"name" : "铝箔",
	"pId" : "150300",
	"id" : "150301"
}, {
	"kind" : "2",
	"name" : "铝塑膜",
	"pId" : "150000",
	"id" : "150400"
}, {
	"kind" : "3",
	"name" : "铝塑膜",
	"pId" : "150400",
	"id" : "150401"
}, {
	"kind" : "1",
	"name" : "电池产品",
	"pId" : "0",
	"id" : "160000"
}, {
	"kind" : "2",
	"name" : "铌酸锂单晶",
	"pId" : "160000",
	"id" : "160100"
}, {
	"kind" : "3",
	"name" : "铌酸锂单晶",
	"pId" : "160100",
	"id" : "160101"
}, {
	"kind" : "2",
	"name" : "钽酸锂单晶",
	"pId" : "160000",
	"id" : "160200"
}, {
	"kind" : "3",
	"name" : "钽酸锂单晶",
	"pId" : "160200",
	"id" : "160201"
}, {
	"kind" : "2",
	"name" : "锂电池",
	"pId" : "160000",
	"id" : "160300"
}, {
	"kind" : "3",
	"name" : "锂电池",
	"pId" : "160300",
	"id" : "160301"
}, {
	"kind" : "2",
	"name" : "碱性蓄电池",
	"pId" : "160000",
	"id" : "160400"
}, {
	"kind" : "3",
	"name" : "碱性蓄电池",
	"pId" : "160400",
	"id" : "160401"
}, {
	"kind" : "2",
	"name" : "太阳能电池",
	"pId" : "160000",
	"id" : "160500"
}, {
	"kind" : "3",
	"name" : "太阳能电池",
	"pId" : "160500",
	"id" : "160501"
}, {
	"kind" : "2",
	"name" : "蓄电池",
	"pId" : "160000",
	"id" : "160600"
}, {
	"kind" : "3",
	"name" : "蓄电池",
	"pId" : "160600",
	"id" : "160601"
}, {
	"kind" : "2",
	"name" : "原电池",
	"pId" : "160000",
	"id" : "160700"
}, {
	"kind" : "3",
	"name" : "原电池",
	"pId" : "160700",
	"id" : "160701"
}, {
	"kind" : "2",
	"name" : "锂蓄电池",
	"pId" : "160000",
	"id" : "160800"
}, {
	"kind" : "3",
	"name" : "锂蓄电池",
	"pId" : "160800",
	"id" : "160801"
}, {
	"kind" : "2",
	"name" : "锂离子电池",
	"pId" : "160000",
	"id" : "160900"
}, {
	"kind" : "3",
	"name" : "锂离子电池",
	"pId" : "160900",
	"id" : "160901"
}, {
	"kind" : "2",
	"name" : "其他电池",
	"pId" : "160000",
	"id" : "161000"
}, {
	"kind" : "3",
	"name" : "其他电池",
	"pId" : "161000",
	"id" : "161001"
}, {
	"kind" : "1",
	"name" : "辅助材料",
	"pId" : "0",
	"id" : "170000"
}, {
	"kind" : "2",
	"name" : "隔膜",
	"pId" : "170000",
	"id" : "170100"
}, {
	"kind" : "3",
	"name" : "25um/干法终端",
	"pId" : "170100",
	"id" : "170101"
}, {
	"kind" : "3",
	"name" : "20um/干法中低",
	"pId" : "170100",
	"id" : "170102"
}, {
	"kind" : "3",
	"name" : "16um/湿法中端",
	"pId" : "170100",
	"id" : "170103"
}, {
	"kind" : "3",
	"name" : "16um/干法中高端",
	"pId" : "170100",
	"id" : "170104"
}, {
	"kind" : "3",
	"name" : "16um/干法中低端",
	"pId" : "170100",
	"id" : "170105"
}, {
	"kind" : "2",
	"name" : "电解液",
	"pId" : "170000",
	"id" : "170200"
}, {
	"kind" : "3",
	"name" : "电解液",
	"pId" : "170200",
	"id" : "170201"
}, {
	"kind" : "2",
	"name" : "化工添加剂",
	"pId" : "170000",
	"id" : "170300"
}, {
	"kind" : "3",
	"name" : "化工添加剂",
	"pId" : "170300",
	"id" : "170301"
}, {
	"kind" : "1",
	"name" : "钴材料",
	"pId" : "0",
	"id" : "180000"
}, {
	"kind" : "2",
	"name" : "电解钴",
	"pId" : "180000",
	"id" : "180100"
}, {
	"kind" : "3",
	"name" : "电解钴",
	"pId" : "180100",
	"id" : "180101"
}, {
	"kind" : "2",
	"name" : "精炼钴",
	"pId" : "180000",
	"id" : "180200"
}, {
	"kind" : "3",
	"name" : "精炼钴",
	"pId" : "180200",
	"id" : "180201"
}, {
	"kind" : "2",
	"name" : "钴粉",
	"pId" : "180000",
	"id" : "180300"
}, {
	"kind" : "3",
	"name" : "钴粉",
	"pId" : "180300",
	"id" : "180301"
}, {
	"kind" : "2",
	"name" : "钴片",
	"pId" : "180000",
	"id" : "180400"
}, {
	"kind" : "3",
	"name" : "钴片",
	"pId" : "180400",
	"id" : "180401"
}, {
	"kind" : "1",
	"name" : "锂材料",
	"pId" : "0",
	"id" : "190000"
}, {
	"kind" : "2",
	"name" : "金属锂",
	"pId" : "190000",
	"id" : "190100"
}, {
	"kind" : "3",
	"name" : "金属锂",
	"pId" : "190100",
	"id" : "190101"
}, {
	"kind" : "1",
	"name" : "钴化合物",
	"pId" : "0",
	"id" : "200000"
}, {
	"kind" : "2",
	"name" : "四氧化三钴",
	"pId" : "200000",
	"id" : "200100"
}, {
	"kind" : "3",
	"name" : "四氧化三钴",
	"pId" : "200100",
	"id" : "200101"
}, {
	"kind" : "2",
	"name" : "氯化钴",
	"pId" : "200000",
	"id" : "200200"
}, {
	"kind" : "3",
	"name" : "氯化钴",
	"pId" : "200200",
	"id" : "200201"
}, {
	"kind" : "2",
	"name" : "硫化钴",
	"pId" : "200000",
	"id" : "200300"
}, {
	"kind" : "3",
	"name" : "硫化钴",
	"pId" : "200300",
	"id" : "200301"
}, {
	"kind" : "2",
	"name" : "硝酸钴",
	"pId" : "200000",
	"id" : "200400"
}, {
	"kind" : "3",
	"name" : "硝酸钴",
	"pId" : "200400",
	"id" : "200401"
}, {
	"kind" : "2",
	"name" : "碳酸钴",
	"pId" : "200000",
	"id" : "200500"
}, {
	"kind" : "3",
	"name" : "碳酸钴",
	"pId" : "200500",
	"id" : "200501"
}, {
	"kind" : "2",
	"name" : "氧化亚钴",
	"pId" : "200000",
	"id" : "200600"
}, {
	"kind" : "3",
	"name" : "氧化亚钴",
	"pId" : "200600",
	"id" : "200601"
}, {
	"kind" : "2",
	"name" : "硫酸钴",
	"pId" : "200000",
	"id" : "200700"
}, {
	"kind" : "3",
	"name" : "硫酸钴",
	"pId" : "200700",
	"id" : "200701"
}, {
	"kind" : "2",
	"name" : "钴酸锂",
	"pId" : "200000",
	"id" : "200800"
}, {
	"kind" : "3",
	"name" : "钴酸锂",
	"pId" : "200800",
	"id" : "200801"
}, {
	"kind" : "2",
	"name" : "草酸钴",
	"pId" : "200000",
	"id" : "200900"
}, {
	"kind" : "3",
	"name" : "草酸钴",
	"pId" : "200900",
	"id" : "200901"
} ];

/*
 * 一级分类
 */
var list1 = [ {
	"kind" : "1",
	"name" : "基础材料",
	"pId" : "0",
	"id" : "100000"
}, {
	"kind" : "1",
	"name" : "正极材料",
	"pId" : "0",
	"id" : "110000"
}, {
	"kind" : "1",
	"name" : "负极材料",
	"pId" : "0",
	"id" : "120000"
}, {
	"kind" : "1",
	"name" : "锂化合物",
	"pId" : "0",
	"id" : "130000"
}, {
	"kind" : "1",
	"name" : "前驱体",
	"pId" : "0",
	"id" : "140000"
}, {
	"kind" : "1",
	"name" : "锂电辅料",
	"pId" : "0",
	"id" : "150000"
}, {
	"kind" : "1",
	"name" : "电池产品",
	"pId" : "0",
	"id" : "160000"
}, {
	"kind" : "1",
	"name" : "辅助材料",
	"pId" : "0",
	"id" : "170000"
}, {
	"kind" : "1",
	"name" : "钴材料",
	"pId" : "0",
	"id" : "180000"
}, {
	"kind" : "1",
	"name" : "锂材料",
	"pId" : "0",
	"id" : "190000"
}, {
	"kind" : "1",
	"name" : "钴化合物",
	"pId" : "0",
	"id" : "200000"
} ];
/*
 * 二级分类
 */
var list2 = [ {
	"kind" : "2",
	"name" : "钴原矿",
	"pId" : "100000",
	"id" : "100100"
}, {
	"kind" : "2",
	"name" : "钴精矿",
	"pId" : "100000",
	"id" : "100200"
}, {
	"kind" : "2",
	"name" : "锂原矿",
	"pId" : "100000",
	"id" : "100300"
}, {
	"kind" : "2",
	"name" : "锂精矿",
	"pId" : "100000",
	"id" : "100400"
}, {
	"kind" : "2",
	"name" : "卤水锂",
	"pId" : "100000",
	"id" : "100500"
}, {
	"kind" : "2",
	"name" : "钴酸锂正极材料",
	"pId" : "110000",
	"id" : "110100"
}, {
	"kind" : "2",
	"name" : "三元正极材料",
	"pId" : "110000",
	"id" : "110200"
}, {
	"kind" : "2",
	"name" : "锰酸锂正极材料",
	"pId" : "110000",
	"id" : "110300"
}, {
	"kind" : "2",
	"name" : "磷酸铁锂正极材料",
	"pId" : "110000",
	"id" : "110400"
}, {
	"kind" : "2",
	"name" : "天然石墨类负极材料",
	"pId" : "120000",
	"id" : "120100"
}, {
	"kind" : "2",
	"name" : "人造石墨类负极材料",
	"pId" : "120000",
	"id" : "120200"
}, {
	"kind" : "2",
	"name" : "中间相碳微球负极材料",
	"pId" : "120000",
	"id" : "120300"
}, {
	"kind" : "2",
	"name" : "预焙阳极",
	"pId" : "120000",
	"id" : "120400"
}, {
	"kind" : "2",
	"name" : "等静压石墨",
	"pId" : "120000",
	"id" : "120500"
}, {
	"kind" : "2",
	"name" : "石墨块",
	"pId" : "120000",
	"id" : "120600"
}, {
	"kind" : "2",
	"name" : "炭电极",
	"pId" : "120000",
	"id" : "120700"
}, {
	"kind" : "2",
	"name" : "天然石墨",
	"pId" : "120000",
	"id" : "120800"
}, {
	"kind" : "2",
	"name" : "石油焦",
	"pId" : "120000",
	"id" : "120900"
}, {
	"kind" : "2",
	"name" : "煤沥青",
	"pId" : "120000",
	"id" : "121000"
}, {
	"kind" : "2",
	"name" : "活性炭",
	"pId" : "120000",
	"id" : "121100"
}, {
	"kind" : "2",
	"name" : "无烟煤",
	"pId" : "120000",
	"id" : "121200"
}, {
	"kind" : "2",
	"name" : "阴极炭块",
	"pId" : "120000",
	"id" : "121300"
}, {
	"kind" : "2",
	"name" : "石墨电极",
	"pId" : "120000",
	"id" : "121400"
}, {
	"kind" : "2",
	"name" : "增碳剂",
	"pId" : "120000",
	"id" : "121500"
}, {
	"kind" : "2",
	"name" : "针状焦",
	"pId" : "120000",
	"id" : "121600"
}, {
	"kind" : "2",
	"name" : "碳酸锂",
	"pId" : "130000",
	"id" : "130100"
}, {
	"kind" : "2",
	"name" : "氢氧化锂",
	"pId" : "130000",
	"id" : "130200"
}, {
	"kind" : "2",
	"name" : "氯化锂",
	"pId" : "130000",
	"id" : "130300"
}, {
	"kind" : "2",
	"name" : "锰酸锂",
	"pId" : "130000",
	"id" : "130400"
}, {
	"kind" : "2",
	"name" : "钴酸锂",
	"pId" : "130000",
	"id" : "130500"
}, {
	"kind" : "2",
	"name" : "磷酸铁锂",
	"pId" : "130000",
	"id" : "130600"
}, {
	"kind" : "2",
	"name" : "镍钴锰酸锂",
	"pId" : "130000",
	"id" : "130700"
}, {
	"kind" : "2",
	"name" : "氧化锂",
	"pId" : "130000",
	"id" : "130800"
}, {
	"kind" : "2",
	"name" : "锂镍钴锰氧化物",
	"pId" : "130000",
	"id" : "130900"
}, {
	"kind" : "2",
	"name" : "磷酸铁锂前驱体",
	"pId" : "140000",
	"id" : "140100"
}, {
	"kind" : "2",
	"name" : "三元前驱体",
	"pId" : "140000",
	"id" : "140200"
}, {
	"kind" : "2",
	"name" : "碳酸锂前驱体",
	"pId" : "140000",
	"id" : "140300"
}, {
	"kind" : "2",
	"name" : "钴酸锂前驱体",
	"pId" : "140000",
	"id" : "140400"
}, {
	"kind" : "2",
	"name" : "极耳",
	"pId" : "150000",
	"id" : "150100"
}, {
	"kind" : "2",
	"name" : "铜箔",
	"pId" : "150000",
	"id" : "150200"
}, {
	"kind" : "2",
	"name" : "铝箔",
	"pId" : "150000",
	"id" : "150300"
}, {
	"kind" : "2",
	"name" : "铝塑膜",
	"pId" : "150000",
	"id" : "150400"
}, {
	"kind" : "2",
	"name" : "铌酸锂单晶",
	"pId" : "160000",
	"id" : "160100"
}, {
	"kind" : "2",
	"name" : "钽酸锂单晶",
	"pId" : "160000",
	"id" : "160200"
}, {
	"kind" : "2",
	"name" : "锂电池",
	"pId" : "160000",
	"id" : "160300"
}, {
	"kind" : "2",
	"name" : "碱性蓄电池",
	"pId" : "160000",
	"id" : "160400"
}, {
	"kind" : "2",
	"name" : "太阳能电池",
	"pId" : "160000",
	"id" : "160500"
}, {
	"kind" : "2",
	"name" : "蓄电池",
	"pId" : "160000",
	"id" : "160600"
}, {
	"kind" : "2",
	"name" : "原电池",
	"pId" : "160000",
	"id" : "160700"
}, {
	"kind" : "2",
	"name" : "锂蓄电池",
	"pId" : "160000",
	"id" : "160800"
}, {
	"kind" : "2",
	"name" : "锂离子电池",
	"pId" : "160000",
	"id" : "160900"
}, {
	"kind" : "2",
	"name" : "其他电池",
	"pId" : "160000",
	"id" : "161000"
}, {
	"kind" : "2",
	"name" : "隔膜",
	"pId" : "170000",
	"id" : "170100"
}, {
	"kind" : "2",
	"name" : "电解液",
	"pId" : "170000",
	"id" : "170200"
}, {
	"kind" : "2",
	"name" : "化工添加剂",
	"pId" : "170000",
	"id" : "170300"
}, {
	"kind" : "2",
	"name" : "电解钴",
	"pId" : "180000",
	"id" : "180100"
}, {
	"kind" : "2",
	"name" : "精炼钴",
	"pId" : "180000",
	"id" : "180200"
}, {
	"kind" : "2",
	"name" : "钴粉",
	"pId" : "180000",
	"id" : "180300"
}, {
	"kind" : "2",
	"name" : "钴片",
	"pId" : "180000",
	"id" : "180400"
}, {
	"kind" : "2",
	"name" : "金属锂",
	"pId" : "190000",
	"id" : "190100"
}, {
	"kind" : "2",
	"name" : "四氧化三钴",
	"pId" : "200000",
	"id" : "200100"
}, {
	"kind" : "2",
	"name" : "氯化钴",
	"pId" : "200000",
	"id" : "200200"
}, {
	"kind" : "2",
	"name" : "硫化钴",
	"pId" : "200000",
	"id" : "200300"
}, {
	"kind" : "2",
	"name" : "硝酸钴",
	"pId" : "200000",
	"id" : "200400"
}, {
	"kind" : "2",
	"name" : "碳酸钴",
	"pId" : "200000",
	"id" : "200500"
}, {
	"kind" : "2",
	"name" : "氧化亚钴",
	"pId" : "200000",
	"id" : "200600"
}, {
	"kind" : "2",
	"name" : "硫酸钴",
	"pId" : "200000",
	"id" : "200700"
}, {
	"kind" : "2",
	"name" : "钴酸锂",
	"pId" : "200000",
	"id" : "200800"
}, {
	"kind" : "2",
	"name" : "草酸钴",
	"pId" : "200000",
	"id" : "200900"
} ];
/*
 * 三级分类
 */
var list3 = [ {
	"kind" : "3",
	"name" : "钴原矿",
	"pId" : "100100",
	"id" : "100101"
}, {
	"kind" : "3",
	"name" : "钴精矿",
	"pId" : "100200",
	"id" : "100201"
}, {
	"kind" : "3",
	"name" : "锂原矿",
	"pId" : "100300",
	"id" : "100301"
}, {
	"kind" : "3",
	"name" : "锂精矿",
	"pId" : "100400",
	"id" : "100401"
}, {
	"kind" : "3",
	"name" : "卤水锂",
	"pId" : "100500",
	"id" : "100501"
}, {
	"kind" : "3",
	"name" : "钴酸锂正极材料",
	"pId" : "110100",
	"id" : "110101"
}, {
	"kind" : "3",
	"name" : "三元正极材料",
	"pId" : "110200",
	"id" : "110201"
}, {
	"kind" : "3",
	"name" : "锰酸锂正极材料",
	"pId" : "110300",
	"id" : "110301"
}, {
	"kind" : "3",
	"name" : "磷酸铁锂正极材料",
	"pId" : "110400",
	"id" : "110401"
}, {
	"kind" : "3",
	"name" : "天然石墨类负极材料",
	"pId" : "120100",
	"id" : "120101"
}, {
	"kind" : "3",
	"name" : "人造石墨类负极材料",
	"pId" : "120200",
	"id" : "120201"
}, {
	"kind" : "3",
	"name" : "中间相碳微球负极材料",
	"pId" : "120300",
	"id" : "120301"
}, {
	"kind" : "3",
	"name" : "预焙阳极",
	"pId" : "120400",
	"id" : "120401"
}, {
	"kind" : "3",
	"name" : "等静压石墨",
	"pId" : "120500",
	"id" : "120501"
}, {
	"kind" : "3",
	"name" : "石墨块",
	"pId" : "120600",
	"id" : "120601"
}, {
	"kind" : "3",
	"name" : "炭电极",
	"pId" : "120700",
	"id" : "120701"
}, {
	"kind" : "3",
	"name" : "天然石墨",
	"pId" : "120800",
	"id" : "120801"
}, {
	"kind" : "3",
	"name" : "石油焦",
	"pId" : "120900",
	"id" : "120901"
}, {
	"kind" : "3",
	"name" : "煤沥青",
	"pId" : "121000",
	"id" : "121001"
}, {
	"kind" : "3",
	"name" : "活性炭",
	"pId" : "121100",
	"id" : "121101"
}, {
	"kind" : "3",
	"name" : "无烟煤",
	"pId" : "121200",
	"id" : "121201"
}, {
	"kind" : "3",
	"name" : "阴极炭块",
	"pId" : "121300",
	"id" : "121301"
}, {
	"kind" : "3",
	"name" : "石墨电极",
	"pId" : "121400",
	"id" : "121401"
}, {
	"kind" : "3",
	"name" : "增碳剂",
	"pId" : "121500",
	"id" : "121501"
}, {
	"kind" : "3",
	"name" : "针状焦",
	"pId" : "121600",
	"id" : "121601"
}, {
	"kind" : "3",
	"name" : "电池级碳酸锂（Li2CO3:99.5%）",
	"pId" : "130100",
	"id" : "130101"
}, {
	"kind" : "3",
	"name" : "工业级碳酸锂（Li2CO3:99%）",
	"pId" : "130100",
	"id" : "130102"
}, {
	"kind" : "3",
	"name" : "单水氢氧化锂（LiOH :≥56.5%;Na:≤0.002% ）",
	"pId" : "130200",
	"id" : "130201"
}, {
	"kind" : "3",
	"name" : "单水氢氧化锂（LiOH :≥96%;Na:≤0.003%  ）",
	"pId" : "130200",
	"id" : "130202"
}, {
	"kind" : "3",
	"name" : "电池级氢氧化锂（LiOH:99% ）",
	"pId" : "130200",
	"id" : "130203"
}, {
	"kind" : "3",
	"name" : "氯化锂",
	"pId" : "130300",
	"id" : "130301"
}, {
	"kind" : "3",
	"name" : "锰酸锂",
	"pId" : "130400",
	"id" : "130401"
}, {
	"kind" : "3",
	"name" : "钴酸锂",
	"pId" : "130500",
	"id" : "130501"
}, {
	"kind" : "3",
	"name" : "磷酸铁锂",
	"pId" : "130600",
	"id" : "130601"
}, {
	"kind" : "3",
	"name" : "镍钴锰酸锂",
	"pId" : "130700",
	"id" : "130701"
}, {
	"kind" : "3",
	"name" : "氧化锂",
	"pId" : "130800",
	"id" : "130801"
}, {
	"kind" : "3",
	"name" : "锂镍钴锰氧化物",
	"pId" : "130900",
	"id" : "130901"
}, {
	"kind" : "3",
	"name" : "磷酸铁锂前驱体",
	"pId" : "140100",
	"id" : "140101"
}, {
	"kind" : "3",
	"name" : "三元前驱体",
	"pId" : "140200",
	"id" : "140201"
}, {
	"kind" : "3",
	"name" : "碳酸锂前驱体",
	"pId" : "140300",
	"id" : "140301"
}, {
	"kind" : "3",
	"name" : "钴酸锂前驱体",
	"pId" : "140400",
	"id" : "140401"
}, {
	"kind" : "3",
	"name" : "极耳",
	"pId" : "150100",
	"id" : "150101"
}, {
	"kind" : "3",
	"name" : "铜箔",
	"pId" : "150200",
	"id" : "150201"
}, {
	"kind" : "3",
	"name" : "铝箔",
	"pId" : "150300",
	"id" : "150301"
}, {
	"kind" : "3",
	"name" : "铝塑膜",
	"pId" : "150400",
	"id" : "150401"
}, {
	"kind" : "3",
	"name" : "铌酸锂单晶",
	"pId" : "160100",
	"id" : "160101"
}, {
	"kind" : "3",
	"name" : "钽酸锂单晶",
	"pId" : "160200",
	"id" : "160201"
}, {
	"kind" : "3",
	"name" : "锂电池",
	"pId" : "160300",
	"id" : "160301"
}, {
	"kind" : "3",
	"name" : "碱性蓄电池",
	"pId" : "160400",
	"id" : "160401"
}, {
	"kind" : "3",
	"name" : "太阳能电池",
	"pId" : "160500",
	"id" : "160501"
}, {
	"kind" : "3",
	"name" : "蓄电池",
	"pId" : "160600",
	"id" : "160601"
}, {
	"kind" : "3",
	"name" : "原电池",
	"pId" : "160700",
	"id" : "160701"
}, {
	"kind" : "3",
	"name" : "锂蓄电池",
	"pId" : "160800",
	"id" : "160801"
}, {
	"kind" : "3",
	"name" : "锂离子电池",
	"pId" : "160900",
	"id" : "160901"
}, {
	"kind" : "3",
	"name" : "其他电池",
	"pId" : "161000",
	"id" : "161001"
}, {
	"kind" : "3",
	"name" : "25um/干法终端",
	"pId" : "170100",
	"id" : "170101"
}, {
	"kind" : "3",
	"name" : "20um/干法中低",
	"pId" : "170100",
	"id" : "170102"
}, {
	"kind" : "3",
	"name" : "16um/湿法中端",
	"pId" : "170100",
	"id" : "170103"
}, {
	"kind" : "3",
	"name" : "16um/干法中高端",
	"pId" : "170100",
	"id" : "170104"
}, {
	"kind" : "3",
	"name" : "16um/干法中低端",
	"pId" : "170100",
	"id" : "170105"
}, {
	"kind" : "3",
	"name" : "电解液",
	"pId" : "170200",
	"id" : "170201"
}, {
	"kind" : "3",
	"name" : "化工添加剂",
	"pId" : "170300",
	"id" : "170301"
}, {
	"kind" : "3",
	"name" : "电解钴",
	"pId" : "180100",
	"id" : "180101"
}, {
	"kind" : "3",
	"name" : "精炼钴",
	"pId" : "180200",
	"id" : "180201"
}, {
	"kind" : "3",
	"name" : "钴粉",
	"pId" : "180300",
	"id" : "180301"
}, {
	"kind" : "3",
	"name" : "钴片",
	"pId" : "180400",
	"id" : "180401"
}, {
	"kind" : "3",
	"name" : "金属锂",
	"pId" : "190100",
	"id" : "190101"
}, {
	"kind" : "3",
	"name" : "四氧化三钴",
	"pId" : "200100",
	"id" : "200101"
}, {
	"kind" : "3",
	"name" : "氯化钴",
	"pId" : "200200",
	"id" : "200201"
}, {
	"kind" : "3",
	"name" : "硫化钴",
	"pId" : "200300",
	"id" : "200301"
}, {
	"kind" : "3",
	"name" : "硝酸钴",
	"pId" : "200400",
	"id" : "200401"
}, {
	"kind" : "3",
	"name" : "碳酸钴",
	"pId" : "200500",
	"id" : "200501"
}, {
	"kind" : "3",
	"name" : "氧化亚钴",
	"pId" : "200600",
	"id" : "200601"
}, {
	"kind" : "3",
	"name" : "硫酸钴",
	"pId" : "200700",
	"id" : "200701"
}, {
	"kind" : "3",
	"name" : "钴酸锂",
	"pId" : "200800",
	"id" : "200801"
}, {
	"kind" : "3",
	"name" : "草酸钴",
	"pId" : "200900",
	"id" : "200901"
} ];